app/views/resources/index.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
        <td><%= resource.description %></td>
        <td><%= Category.find(resource.category_id).name %></td>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
        <td><%= resource.last_modified %></td>
		<td><%= User.find(resource.owner_id).name %></td>