app/views/resources/show.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>Category:</strong>
  <%= Category.find(@resource.category_id).name %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>Owner:</strong>
  <%= User.find(@resource.user_id).name %>