app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Martin"], ["email", "test@test.com"], ["salt", "$2a$10$GpQ7exxao5POKOoqqjl.W."], ["created_at", "2016-11-08 00:19:17.486985"], ["updated_at", "2016-11-08 00:19:17.486985"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save